{
  "id": "article-1753068659933",
  "title": "Coaching Grappling Athletes",
  "content": "Coaching Advice for Grappling Athletes: Wrestling,\nJudo, and BJJ\nGrappling sports like wrestling, judo, and Brazilian Jiu-Jitsu (BJJ) share many core principles, yet each has\nunique nuances in training and competition. This comprehensive analysis compiles coaching advice from\npeer-reviewed sports science research, respected coaching manuals, and community discussions (e.g.\nReddit forums and social media), organized into clear categories. We cover general athletic preparation,\ngrappling-specific technical tips, discipline-specific strategies, and mental/tactical advice. Throughout, we\nhighlight common themes – such as the emphasis on fundamentals and conditioning – and note\ndifferences between disciplines or sources. All scientific claims are backed by evidence, and practical\ninsights from experienced coaches and athletes are included for actionable guidance.\nGeneral Athletic Preparation (Strength, Conditioning, Nutrition,\nRecovery)\nStrength & Power Training: All grappling disciplines recognize the importance of building\nfunctional strength. Improved muscular strength and power enhance an athlete’s ability to finish\ntakedowns, execute throws, and dominate positions. For example, elite BJJ players show high\nlevels of strength and anaerobic power, correlating with success on the mat. Modern judo\nand wrestling programs incorporate weightlifting (squats, deadlifts, presses, pulls) and explosive\nexercises (Olympic lifts, plyometrics) to increase grip strength, hip drive, and overall explosiveness\n. As a judo article notes, what was once a “nice-to-have” is now essential – strength training,\nwhen done in balance, complements technique rather than undermining it. Stronger\ngrapplers can impose their game more easily, assuming skill levels are equal. Notably, grip\nstrength is a specific asset: judo and BJJ athletes benefit from exercises like towel pull-ups or\nfarmer’s carries to develop forearm and hand endurance for gripping the gi or an opponent’s limbs\n. Coaches do caution that strength should never replace technique, but rather provide a\nhigher potential for applying technical moves.\nConditioning & Endurance: Grappling matches are brutally demanding on the cardiovascular\nsystem. Unlike steady-state endurance sports, grappling is intermittent – bursts of explosive activity\npunctuated by short rest or slower exchanges. All three disciplines require a mix of aerobic\nendurance (to sustain effort over multiple minutes or multiple matches) and anaerobic conditioning\n(for intense scrambles and power moves). Sports science reviews show BJJ athletes have VO₂max\nvalues similar to other grapplers (~42–52 ml/kg/min), indicating solid aerobic fitness, while\nwrestling is noted to rely even more on anaerobic power due to its short match length (often 6\nminutes or less). Coaches advise incorporating high-intensity interval training (HIIT) and\nsport-specific conditioning drills to mimic match demands. For instance, wrestlers often do\n“shark tank” rounds (fresh partners cycling in) to push their anaerobic threshold, and judokas\npractice consecutive throw drills to build stamina. Work capacity – the ability to grapple hard for the\nwhole match and through a day of tournament bouts – is a major differentiator at advanced levels\n• \n12\n31\n45\n67\n8\n910\n1112\n• \n1314\n15\n1617\n218\n1\n\n. As legendary wrestling coach Dan Gable put it, conditioning can win matches: “The 2nd\nperiod is won by the kid in the best shape.” In practice, this means grapplers must do roadwork\n(running, swimming, etc.), circuits, and lots of sparring to develop a deep gas tank. Both aerobic\nendurance (for recovery and sustained effort) and muscular endurance (ability to perform\nrepeated grips, shots, or escapes without fatigue) should be targeted. Effective conditioning\nalso reduces injury risk from exhaustion and allows athletes to maintain mental clarity under stress.\nFlexibility and Mobility: Grappling pushes joints through extreme ranges, so flexibility is highly\nvalued. High-level grapplers tend to have above-average flexibility – one review noted experienced\nBJJ athletes were more flexible than novices. Flexibility in the hips, shoulders, and core can\nimprove guard work in BJJ, help escape tight pins in wrestling, and allow judoka to enter throws\nmore deeply. Coaches include dynamic stretching, mobility drills, and yoga/gymnastics elements in\ntraining to enhance range of motion and prevent injuries. Common focus areas are hip\nmobility (for guard retention and wrestling sprawls), hamstrings and lower back (for takedown\nposture and inversion in BJJ), and shoulder mobility (for posting, posting and rolling out of throws,\netc.). For example, BJJ instructors often start class with hip escape (shrimp) and bridge drills – these\nnot only ingrain movements but also keep the body limber. Judo coaches drill ukemi (breakfalling)\nwhich inherently improves flexibility and rolling ability. Adequate flexibility also contributes to injury\nprevention: a limber athlete is less likely to pull a muscle during an awkward scramble. It’s worth\nnoting that mobility (active range of motion and control) is prioritized over mere static flexibility –\ngrapplers benefit from being able to move fluidly into positions. Stretching routines and proper\nwarm-ups (discussed more under recovery) are an entrenched part of grappling practice for this\nreason.\nNutrition and Weight Management: Grappling is typically divided into weight classes, so nutrition\nis critical not just for performance but also for making weight. General advice is for grapplers to\nconsume a balanced diet with ample lean protein (for muscle repair), quality carbohydrates (for\nfueling high-intensity efforts), and fruits/vegetables for micronutrients. In practice, many\nathletes periodize their diet: eating higher carbs in heavy training periods and adjusting intake when\ntapering or cutting weight. Weight cutting deserves special mention in wrestling, judo, and BJJ\ncompetitions. Traditional wrestling culture involved severe dehydration and fasting to shed pounds\nbefore weigh-ins, but modern coaching strongly emphasizes safer approaches. Experts\nrecommend gradual weight loss in the weeks prior – through a slight calorie deficit and increased\nexercise – rather than drastic last-minute dehydrating. A sports physiologist in an ESPN feature\nadvises bringing down weight slowly (e.g. ~0.2–0.3 kg per day) by reducing carbs and sodium, while\nmaintaining training intensity, so that only 1–2 kg are left to sweat out the day before competition\n. This prevents excessive performance decline. After weigh-in, proper rehydration and\nrefueling are crucial; coaches often have wrestlers and judoka rehydrate with electrolyte drinks and\neat easily digestible, high-carb meals to replenish energy. In BJJ, day-before weigh-ins (in some\nevents) allow more recovery, but same-day weigh-ins (common in judo and wrestling) require\nsmarter cutting and rehydration strategies. Overall, the consensus is: diet is part of an athlete’s\ntraining. Many grappling gyms now provide nutritional guidance, teaching athletes to avoid junk\nweight cuts, to not drop weight at the expense of strength, and to always train and compete well-\nfueled. In short: you can’t out-train a poor diet. Consistently eating enough protein, staying hydrated,\nand consuming sufficient carbs for training are seen as the basics of grappler nutrition.\n1419\n20\n1921\n• \n22\n2324\n• \n2526\n2728\n27\n2729\n3031\n2\n\nRecovery, Rest, and Injury Prevention: High-level training is only effective if balanced with\nrecovery. Grappling takes a toll on the body – muscle soreness, joint strain, and the occasional\nminor injury are common. Coaches therefore stress that rest is as important as training. A sports\nperformance article specifically on BJJ notes that rest and recovery are “essential parts” of training\nthat many people neglect. Adequate recovery allows athletes to train more often and with higher\nquality, whereas neglecting it can lead to overtraining, burnout, or injury. Key recovery\npractices include sleep (aiming for 7–9 hours for hard-training athletes), proper nutrition and\nhydration (which aid muscle repair), and scheduling rest days or light days. Staying hydrated and\nmaintaining electrolyte balance, for instance, helps prevent cramps and improve next-day\nperformance. Some grapplers use modern techniques like foam rolling, sports massage, or\ncontrast showers, but the fundamentals remain sleep and diet. Coaches often program light\ntechnical sessions or active recovery (e.g. swimming, mobility work) in between intense sparring\ndays. Injury prevention protocols are also integrated. A recent evidence-based review proposed a\nstructured injury-prevention warm-up for grappling sports to address common injury patterns\n. For example, since takedowns and throws are a leading cause of injuries, a warm-up might\ninclude tumbling drills, dynamic stretching, and sport-specific movements to prepare the body.\nResearch shows that a proper warm-up can significantly reduce injury incidence in grapplers.\nMany clubs follow something akin to the FIFA 11+ (a soccer injury prevention program) but adapted\nfor grappling – including neck exercises (to prevent cervical injuries), shoulder stability work, and\nhip/ankle mobility drills. Additionally, strength training itself is protective: stronger muscles and\ntendons help cushion joints. As noted in a judo strength guide, resistance training is “the number\none thing you can do to avoid injuries” – it fortifies the body against the stresses of throws and\ngrappling impacts. Another aspect of prevention is listening to one’s body: athletes are\nencouraged to communicate with coaches about fatigue or pain and to take deload weeks as\nneeded. Consistent recovery practices (good sleep hygiene, proper warm-ups/cool-downs, and not\npushing through serious pain) can extend an athlete’s longevity on the mats. Ultimately, the goal is to\ntrain hard and train long – a balance of intensity and recovery yields the best results.\nConsistency and Training Habits: A broad piece of general advice across all sources is to train\nconsistently. There is no substitute for mat time; regular practice ingrains skills and builds\nconditioning that sporadic training cannot. Coaches often prefer an athlete who trains moderate\namounts year-round over one who oscillates between boot-camp intensity and long breaks. For\nbeginners, a common recommendation is attending 2–3 classes per week minimum to see steady\nprogress. One BJJ coaching article bluntly states: “Consistent training is essential – steady\nattendance and repetition will help you internalize techniques more effectively”. This holds true\nin wrestling and judo as well. That said, consistency also means finding a sustainable routine – it’s\nbetter to start at a manageable frequency and ramp up than to burn out after an initial surge. Elite\ngrapplers eventually often train daily (sometimes twice a day), but they build up to that level.\nConsistency applies not just to showing up, but also to effort: bringing focus and intent to each\npractice. Drilling a move hundreds of times over weeks is what sharpens technique for competition.\nConsistency in conditioning (maintaining off-season fitness) and in diet (year-round healthy eating,\nnot just pre-tournament) also sets top athletes apart. A wrestler’s maxim is “summer wrestling\nmakes winter champions,” underscoring that those who train when others take off will have an\nedge. In summary, general athletic preparation for grappling sports means being a well-rounded\nathlete – strong, conditioned, flexible – with good habits that support continuous improvement. The\ncommon theme is preparation: the better you prepare your body, the more effectively you can apply\ntechnique and strategy in live grappling.\n• \n32\n3233\n34\n35\n36\n35\n36\n3738\n• \n3940\n40\n3\n\nTechnical Skills and Drills in Grappling (Technique, Position,\nDrilling)\nMaster the Fundamentals First: A universal coaching theme is to focus on fundamental\ntechniques and positions before chasing high-difficulty moves. In BJJ, for example, beginners are\nurged to master basic escapes, positional controls, and high-percentage submissions (armbars,\ntriangle chokes, etc.) before attempting flashy techniques. A reputable BJJ curriculum (Saulo\nRibeiro’s, for instance) prioritizes survival and escapes for white belts, solid guard passing and\nsweeps for blue belts, and so on – building a pyramid of skills. The reason is simple: advanced moves\nonly work if set up by solid basics. This holds true in wrestling and judo as well. Double-leg\ntakedowns, single-legs, hip throws, and positional pins are fundamentals that athletes drill\nrelentlessly. Interestingly, even at elite levels, matches are often won with “basic” moves executed\nextremely well. An experienced wrestling coach points out that in the Olympic finals, the deciding\nscores might come from a double-leg takedown or a simple go-behind – techniques learned in\none’s first year of wrestling. The highest achievers have “brilliance with the basics” . This\nprinciple is echoed in judo: the most successful competitors typically specialize in a couple of throws\n(uchimata, seoi-nage, etc.) and do them masterfully. Coaches often say “don’t fear the man who\nknows 1000 techniques; fear the man who has practiced one technique 1000 times.” Thus,\npractice time is devoted heavily to fundamental drills – e.g., pummeling for underhooks in wrestling,\ngrip fighting in judo, hip escape and guard retention drills in BJJ. Strong fundamentals also make you\ncoachable – athletes with sound basics can absorb advanced strategies later, whereas those with\nflashy but shaky fundamentals hit a ceiling. Across grappling sports, the advice is clear: build a\nstrong foundation. (Or as many BJJ gyms post on their walls: “Basics > fancy moves.”)\nTechnique and Leverage Over Strength: Grappling is often described as “physical chess” – strategy\nand technique can trump brute force. A common reminder from coaches is that leverage, body\nmechanics, and timing create efficiency. Renzo Gracie and John Danaher famously said: “Reduced to\nits core, jiu-jitsu is the employment of intelligence and skill to overcome brute strength and\naggression.” In practice, this means using an opponent’s force against them and applying\ntechniques with proper mechanics so that even a smaller person can prevail. For example, dropping\nlevels and using one’s legs and hips (the strongest muscles) is far more effective for a takedown than\nmuscling with the arms. Judo’s principle of “maximum efficiency, minimum effort” (Seiryoku Zen’yō)\nencapsulates this – you off-balance the opponent (kuzushi) and use momentum to throw, instead of\npure lifting. In BJJ, new students learn that positioning and technique enable a smaller grappler to\nchoke a larger one by targeting weak points like the neck or joint locks applied with the whole body.\nCoaches will often have stronger athletes roll with strict technique (avoiding strength-based escapes)\nto instill this habit. A concrete example of technique > strength is the concept “position before\nsubmission.” This classic BJJ adage reminds grapplers to secure a dominant position and proper\ncontrol before hunting for a finish. If one hastily jumps on a submission without position, a savvy\nopponent will escape or counter. By prioritizing positional control (like achieving mount or back\ncontrol), you both tire out your opponent and reduce their escape options when you do attempt the\nsubmission. Similarly, a wrestler focuses on breaking an opponent’s posture and hips down\nbefore trying to turn them for a pin. In judo, judoka set up throws by gripping and off-balancing first\nrather than trying to lift an opponent outright. The technical advice across disciplines is to use\nleverage points – e.g., underhooks, lapel grips, posting on the mat – to multiply force. As one BJJ\ninstructor put it, “BJJ is a sport that emphasizes technique and leverage over brute strength”.\nStrength and speed help, but they are icing on the cake; the cake is sound technique. This theme is\n• \n41\n424342\n• \n44\n45\n46\n47\n4\n\nreinforced in training by drilling with progressive resistance: start moves smoothly, get the\nmechanics right, then add resistance to ensure you’re not resorting to sheer strength. In summary,\ngrapplers are coached to be smart fighters: apply physics and strategy, not just athletics.\nDrill, Drill, Drill (Repetition): Repetition is the mother of skill in grappling. A common piece of\nadvice is “drillers make killers,” meaning the more you rehearse a technique, the more instinctive and\neffective it becomes. Practice includes isolated drilling (repeating a move in a cooperative setting)\nand positional sparring (live practice from set positions), in addition to regular sparring. Scientific\nunderstanding of motor learning supports this: high repetitions build muscle memory so that\ntechniques can be executed under pressure with minimal conscious thought. For example, judo\nplayers do uchikomi (entry drills) hundreds of times per session – this ingrains the feel of proper\nentry for throws. BJJ classes often include drilling a sweep or submission 10–20 times each side with\na compliant partner before live rolling. A competition-focused BJJ guide emphasizes “repetition is\nparamount to mastery” – suggesting ample time dedicated to drilling one’s A-game techniques to\ninstinctively hit them in a tournament. Wrestling coaches run stance-and-motion and\npenetration-shot drills daily, so that a wrestler’s shots are fast and well-timed. The key is consistent,\nquality reps: sloppy drilling is discouraged, as it can ingrain bad habits. Instead, athletes are taught\nto practice perfectly, then gradually add speed and intensity. Positional sparring is another\ninvaluable drill method – e.g., starting every roll from guard, or having one person start on the\nother’s back – to funnel practice into areas that need work. This kind of specific training accelerates\nlearning by increasing repetitions of those scenarios. On forums like Reddit, experienced grapplers\noften advise newcomers to allocate part of open-mat time to drilling what they learned that week,\nnot just free-rolling. The benefit of repetition was also highlighted in the mental preparation context:\nby drilling a technique thousands of times, you gain confidence that you can execute it when\nexhausted or stressed. To keep drills from becoming stale, coaches use variations – for instance,\nsituational drills with moderate resistance, or “flow rolling” where partners go back-and-forth with\ntechniques. But the bottom line remains: time on task. If you want a great double-leg, you might do\ntens of thousands of shots in your career. Consistent drilling builds the neural pathways and reflexes\nthat distinguish an expert from a novice.\nPositional Strategy and Grappling IQ: Grappling isn’t just about moves in isolation – it’s about how\nyou transition and maintain advantageous positions. Thus, coaching emphasizes understanding\npositional hierarchies and strategies. In BJJ, this means learning the importance of dominant\npositions (back mount, mount, side control) and how to progress through them (guard -> pass ->\nside control -> mount -> back, etc.). The mantra “position before submission” (mentioned above)\nhighlights strategy: you accumulate positional advantage which both scores points (in sport BJJ) and\nincreases threat. For wrestlers, position often refers to stance and balance – e.g. staying low, with\nhead up and hips under you, so you don’t get taken down. A wrestler with good position is hard to\nmove or score on. Wrestlers are coached to “maintain good position” even during attacks –\nmeaning no reckless shots that put you under your opponent, and no exposure of your back. In\njudo, kuzushi (off-balancing) is a positional concept – you create an angle or unsteady stance in\nyour opponent before executing a throw. One Reddit judoka advised a beginner: “Don’t worry about\nthrowing at first; get your grips, maintain good posture and balance, and just move your partner around\nthe mat... upsetting their balance without using excessive force”. This drill teaches feeling an\nopponent’s balance – a positional skill – rather than blindly attacking. Grappling “IQ” involves\nknowing where on the body to control the opponent. For instance, controlling the hips is paramount\nin wrestling (to prevent your opponent from standing or bridging out) and likewise in BJJ (pinning the\n• \n48\n48\n48\n• \n4950\n5\n\nhips can kill an opponent’s escape attempts). In BJJ, a concept of “frames and pressure” is taught:\nuse your limbs as frames to maintain distance or pressure to hold someone down. These are\npositional skills that enable smaller grapplers to neutralize bigger ones by aligning force through\nskeletal structures instead of muscle. Coaches also teach transitions: how to move fluidly from one\nposition to the next best position. An example is chain passing in BJJ – if a guard pass is blocked,\nimmediately transition to a different pass or backstep to another position, rather than stopping. In\nwrestling, this is chain wrestling: if a single-leg is defended, transition to a double or a front headlock\nspin-behind. Practitioners are encouraged to always think two steps ahead – if the opponent\ncounters your move, know the follow-up. This creates a strategical flow where you stay one move\nahead. Position also ties into point strategy in sport contexts: a wrestler near the edge of the mat\nwill circle in to avoid giving up position or a push-out point; a BJJ athlete ahead on points might play\nsafe in a dominant position rather than risk losing it. Good coaching covers these tactical aspects:\ne.g., “If you’re up on points with 30 seconds, keep a solid side control and don’t give space.” In sum,\nbeyond individual techniques, grapplers are taught a positional framework: how to systematically\nadvance position, deny the opponent their position, and capitalize on transitions. This positional\nunderstanding often separates intermediate grapplers from beginners. It’s often said that a black\nbelt in BJJ is just a white belt who excelled at the fundamentals and never quit – meaning they\nhave superior basics and positional understanding.\nSpecific Training Methods: Grappling coaching employs a variety of training methods to build\ntechnical skill. Aside from standard drilling and sparring, some notable methods include:\nSituational/Positional Sparring: As mentioned, starting sparring from set positions (e.g., start with\none person in mount, or start with double sleeve grips in guard for BJJ, or start in over-under clinch\nfor Greco wrestling). This method targets specific skills (escaping mount, executing armbar from\nguard, finishing a single-leg, etc.) and ensures even rarely encountered positions get practiced. It’s a\ncontrolled way to get repetitions under realistic resistance in those scenarios.\nIsolation Sparring: Similar to positional sparring, but even more restricted – for example, in BJJ “grip\nfighting only” rounds where the goal is just to establish dominant grips for takedowns without\ncompleting the takedown, or in judo “uchikomi with light resistance” rounds, or wrestling hand-\nfighting practice where no shots are allowed initially. These isolate one aspect of the fight to focus\nimprovement.\nFlow Rolling / Technical Sparring: Especially in BJJ, flow rolling is sparring at ~50% intensity where\nboth partners move through techniques in a continuous exchange without fully resisting. This builds\ntiming and creativity, and allows practice of new moves in a low-risk setting. Judo has something\nsimilar called yakusoku-geiko (pre-arranged sparring) where each judoka takes turns attacking and\ndefending throws in a flowing manner.\nDrilling with Resistance: Once a technique is learned, coaches may have students drill it with\nprogressive resistance – e.g., your partner gives 20% resistance, then 50%, so you learn to adjust\nwhen it’s not perfect. Eventually this blends into full sparring. An example is practicing a triangle\nchoke where the partner occasionally tries to posture up, and the attacker learns to adjust their\nangle – a live element to drilling.\nCombination Drills: In wrestling and judo especially, combination techniques are drilled. For\ninstance, a wrestler might drill a high-crotch takedown immediately transitioning to a double-leg\nfinish if the opponent defends – repeating that combo as one sequence. Judoka drill renraku-waza\n(combos) like ouchi gari (inside trip) to kouchi gari (small inside trip) to finish a resisting opponent.\nThis builds instinct for chaining moves when the first attempt is foiled.\n• \n• \n• \n• \n• \n• \n6\n\nTimed Drill Circuits: Some coaches set up stations – e.g., 2 minutes of throw entries, then 2 minutes\nof guard retention drill, then 2 minutes of shots sprawls, rotating partners. This keeps training\nintense and varied, almost like HIIT for technique.\nVisualization/Walk-throughs: Not a physical drill per se, but coaches sometimes have athletes walk\nthrough their game plan techniques slowly or even just visualize them. For example, shadow-\nwrestling (like shadow-boxing) is used to practice level changes and shots solo. Mental rehearsal of\ntechniques can supplement physical reps, especially when resting or if injured.\nThe above methods are used to keep training efficient and focused. Rather than just doing 10 rounds of\nfree sparring (which has its place for conditioning and broad skill application), targeted drills ensure specific\ntechniques get enough attention. One community insight from BJJ is that hobbyist practitioners with limited\ntraining time benefit greatly from dedicating part of each session to drilling key moves, as opposed to only\nrolling – it accelerates technical progress. Specificity is also key: for example, grapplers who compete in no-gi\nBJJ will include more wrestling-style takedown drills and gripping drills without the gi, whereas gi\npractitioners will spend time on collar and sleeve grip fighting. Coaches align drills with the competition\nrules and common scenarios of their discipline (e.g., judo newaza drills are short and explosive because in\njudo competition you get only a brief time on the ground to secure a pin or submission). In summary,\neffective technical training in grappling is structured: a blend of repetitive drilling, controlled situation\nsparring, and live sparring, all geared toward developing a game that will hold up under pressure.\nSafety and Technique Execution: Technical advice also includes how to train safely and correctly.\nGrappling involves potentially dangerous moves (joint locks, high-amplitude throws), so coaches\ninstill safety protocols. Tapping is one – in BJJ (and judo submissions), the rule is “tap early, tap often”\nto avoid injury and learn in the process. Beginners might be reminded constantly to swallow\ntheir ego and tap if caught in an armbar or choke, since injuries will only set back progress. Likewise,\nwhen applying submissions in training, good gyms enforce controlled application – apply slowly\nand with control, give your partner a chance to tap. In wrestling and judo, proper falling\ntechnique (ukemi) is emphasized from day one to prevent injuries when thrown. A new judoka\nspends a lot of time learning to breakfall in all directions. This not only prevents injury (e.g., reducing\nrisk of concussion or shoulder injury from a throw) but also increases confidence – if you aren’t afraid\nof being thrown, you will spar more freely. Coaches also teach proper posture and alignment to\nexecute techniques efficiently. For example, on a double-leg takedown: keep your back straight,\nhead up, and step in with good posture to avoid neck injuries and maximize power. In judo throws,\nlocking your core and lifting with the legs prevents back injuries. Many injuries in grappling happen\nwhen technique breaks down under fatigue, so drilling good form is a preventative measure.\nAnother aspect of safety is training etiquette: e.g., in BJJ, don’t yank on someone’s neck cranking a\nguillotine; in wrestling, don’t slam practice partners; in judo randori, take care of your partner by not\nfinishing a throw in a way that injures. Good coaches foster a culture of looking out for each other’s\nwell-being. As a result, students develop trust and can train harder knowing their partners will\nrelease submissions or not intentionally hurt them. In summary, technical excellence and safety\ngo hand in hand – clean technique not only is more effective but also safer. Whether it’s tapping out,\nbreakfalling, or executing a move with correct form, the advice is to ingrain these habits early. They\nkeep you on the mat, which in the long run means more learning and success.\n• \n• \n• \n51\n7\n\nDiscipline-Specific Strategies and Advice\nWhile the core principles of grappling apply broadly, each discipline – wrestling, judo, and BJJ – has unique\nemphases and traditional wisdom. Below, we outline advice particular to each sport, noting how coaching\nis tailored to the rules and typical scenarios of that discipline.\nWrestling\nStance and Movement: In wrestling, everything starts from a good stance. Coaches will spend\nsignificant time drilling wrestlers to stay in a low, balanced stance with knees bent, back straight,\nhead up, and hands ready. A solid stance is your first line of defense – it makes you harder to take\ndown and ready to sprawl or shoot. Footwork drills (like shadow wrestling and stance-motion drills)\ningrain the habit of staying in stance while moving. Wrestlers are taught to move their feet\nconstantly, creating angles and setups. Unlike judo/BJJ that begin standing but often go to ground,\nwrestling is continuously contested on the feet for takedowns, so superior footwork and stance can\ndominate a match. A common coaching cue: “Level change!” – reminding wrestlers to lower their hips\nwhen closing distance to avoid getting caught upright. \nAttacks and Chain Wrestling: Wrestling is very offense-oriented – you score by taking down or\npinning the opponent – so athletes are encouraged to “shoot your shot” and not be passive. One\nstrategy is chain wrestling: linking techniques in combination. For example, an outside single-leg\nattempt might transition to a double-leg if the opponent sprawls, then to a body lock if they defend\nthat – never giving them a pause. Coaches develop drills for these sequences so that wrestlers react\nto defenses automatically with the next move. An old adage: “Finish your shots” – meaning once you\ncommit to a takedown, keep driving and switch off to other finishes until the opponent is on the\nmat. Top wrestlers constantly pressure their opponents, forcing reactions and capitalizing. They also\ndictate ties (grip/clinch positions): whether it’s an underhook, two-on-one (Russian tie), or head\ncontrol, wrestlers fight to get their preferred tie and deny the opponent’s tie. A piece of advice from\na high-school coach encapsulates this: “Dictate the position, dictate the scoring, dictate the match. Focus\non what you do well, then go do it.” In practical terms, if you have a great single-leg, you work to get\nthat single-leg grip and attempt it over and over, instead of playing in the opponent’s strongest\nposition. Wrestlers also learn setups – using hand-fighting, head snaps, fakes, and footwork to\ncreate openings for shots. The mantra “set it up!” is yelled often in practice, reminding athletes not\nto shoot blindly but to make the opponent move or react first. \nDefense and Scrambles: On the flip side, wrestling has a wealth of defensive skills. Sprawling is\nfundamental – dropping hips to the mat and sprawling legs back when someone shoots – to counter\ntakedowns. Wrestlers drill sprawls repeatedly so it becomes reflex. They’re also taught to “down\nblock” (block with hands) and control an opponent’s arms and head to prevent clean shots. When a\nshot does penetrate, wrestlers engage in scrambles – improvised positions where both are fighting\nfor control (e.g., whizzer and leg control situations). A common piece of advice is to “keep\nwrestling” through positions – meaning, don’t stop until the referee whistles. Many reversals or\ndefensive scores happen because one wrestler relaxed too soon. For instance, if taken down, a\nwrestler might immediately roll into a peterson (reversal) or a granby roll to escape – turning\ndefense into offense. Mental toughness in these moments is key; coaches simulate scramble\nscenarios in practice to develop this never-give-up attitude. Another specific tactic: whizzer and hip-\n• \n• \n• \n8\n\nheist – if someone gets in on your leg, you might whizzer (overhook their arm with pressure) and\nhip-heist to create a stalemate or counter. These techniques are staples of wrestling defense.\nMat Wrestling (Top and Bottom): Unique to wrestling (compared to judo/BJJ) is the referee’s\nposition and the focus on turns and escapes. When on top position, wrestlers aim to pin or earn\nnear-fall points by turning an opponent’s back toward the mat. Coaching for top position includes\nrides like spiral ride, tight waist and chops, and pinning combinations (half nelsons, arm bars,\ncradles). A good top wrestler can break the opponent down flat and methodically work for a pin.\nAdvice for top: “Keep your weight on them, wear them out, and be a step ahead.” That means\nanticipating escape attempts and re-breaking them down. On bottom position, the primary\nobjective is to escape or reverse. Wrestlers practice explosive stand-ups, hip heists, switches, and\nrolls to get out from bottom. One classic coaching line: “Wrestle smart from bottom – first move, best\nmove.” The bottom wrestler should explode as soon as the whistle blows, because that initial\nmoment is the best chance to escape before the top applies a ride. Hand-fighting is drilled here too:\nclearing the opponent’s grips on your wrists/ankles is key to standing up. Wrestlers are taught to\nnever rest belly-down; they must keep working to improve position, since in folkstyle wrestling if\nyou stall on bottom you can get penalized. \nConditioning and Pace: As touched on earlier, wrestling matches are short (often 3 periods totaling\n6–7 minutes in folkstyle, shorter in freestyle/Greco) but very intense. Coaches instill the mindset of\nwrestling at a high pace – breaking the opponent’s will through pressure. Dan Gable was notorious\nfor his Iowa team’s conditioning; the idea was that Iowa wrestlers would outlast and overwhelm\nopponents in period 3. A well-known Gable quote: “I always liked to train so that my opponent, when he\nknew he was wrestling me, he knew he was going to get tired.” Pushing the pace also can force mistakes\n– a tired opponent is likely to give up a sloppy shot or ease on defense, which opens scoring\nopportunities. So wrestlers often try to “grind down” the opponent with constant snaps, ties, and\nhalf-shots to sap their energy. Coaches measure success not just by points scored, but by observing\nwhether their wrestler is controlling the tempo of the match. Being aggressive (but smart) is usually\nrewarded under wrestling rules (e.g., the more passive wrestler can get hit with a stalling penalty).\nTherefore, wrestling advice often centers on work rate: “Hands moving, feet moving – make him react\nto you.” Of course, pacing oneself is also a skill – spurts of all-out effort should be timed tactically (for\ninstance, a last 30-second push). But generally, wrestlers err on the side of offensive output. This is\na bit different from BJJ, where a more patient strategy can succeed; in wrestling, if you don’t score,\nyour opponent will. \nMindset and Toughness: Wrestling has a very rich culture of mental toughness and discipline.\nPractitioners often say wrestling is as much mental as physical. Athletes are pushed through\ngrueling practices – not just to build cardio, but to forge a mindset that “nothing in a match will be\nharder than what I’ve done in practice.” Common mental advice: “Never quit on a position – fight until\nthe finish.” We see this in the way wrestlers will bridge desperately to avoid a pin or keep fighting off\ntheir back as seconds tick down. There’s a pride in enduring discomfort (like cutting weight or\nfighting through fatigue). At the same time, there’s increasing awareness of smart training – that\nit’s not only about grind, but about confidence and focus. Olympic champion John Smith’s philosophy\nwas extremely technical, emphasizing slick technique and believing that excellence breeds\nconfidence. So modern coaching balances the old-school hard-nose approach with positive mindset\ntechniques. One example: many wrestling teams do visualization and positive self-talk drills (though\nperhaps not as openly discussed as in other sports). Still, wrestling room quotes often read, “Once\n• \n• \n• \n9\n\nyou’ve wrestled, everything else in life is easy.” – highlighting that the sport’s challenges prepare you for\nanything. Camaraderie and team support are also emphasized in scholastic wrestling;\nteammates push each other and hold each other accountable. \nRule-Specific Tactics: Each style of wrestling (folkstyle vs freestyle vs Greco-Roman) has some\nspecific tactics. In American folkstyle (collegiate/high school), riding time, escapes, and near-fall\ncount, so strategies like riding an opponent to accumulate riding time or intentionally releasing an\nopponent to go for another takedown (the “takedown game”) are coached. In freestyle, exposure is\nkey, so gut-wrench and leg lace turns are drilled for top, and avoiding exposure (rolling to stomach\ninstead of back when thrown) is taught for defense. In Greco, upper-body throws and hand-fighting\nare the focus (since no leg attacks are allowed). But going deep here may be beyond scope – suffice\nto say, a coach tailors training to the competition ruleset. For example, a U.S. collegiate coach will\nhave his athletes practice mat returns (lifting and returning a standing bottom wrestler to the mat),\nwhereas a freestyle coach will practice par terre defense (resisting gut-wrench turnovers) and not\nworry about mat returns. An awareness of the scoring nuances – like how many points a particular\nthrow or exposure is worth, or how passivity is called – factors into advanced strategy. \nIn summary, wrestling-specific advice centers on aggression, excellent takedowns, solid defense, and\nunparalleled conditioning. Wrestlers learn to impose their will: from the tie-ups they want, to the\nrelentless pace, to dominating on top. They also pay special attention to weight management and peaking\nfor competitions (often a season culminating in a championship). Wrestling’s mantra could be “Hard work\nand technique conquers all.” A combination of grind and finesse, as encapsulated by the balance of being the\nbest technician, in the best shape, with the biggest heart.\nJudo\nGrip Fighting (Kumi-Kata): One of the first things a judoka learns is that grips can decide matches.\nUnlike wrestling (where you grab the body) or no-gi grappling, judo involves gripping the opponent’s\njacket (gi), and whoever dominates grips largely dictates the fight’s flow. Grip fighting drills are a\ndaily staple in judo training. Students practice securing their preferred grip (e.g., a strong sleeve and\nlapel grip, or an over-the-back grip) while preventing opponents from getting theirs. Coaches often\nallocate specific randori rounds to grip-fighting only – no throws, just fighting for grips. Olympic\nmedalist and coach Jimmy Pedro is well-known for his systematic approach to grips, and many\nadvise studying his methods. A common piece of judo advice: “Win the grip, win the throw.” For\nbeginners, it might be overwhelming, so coaches suggest focusing on basic grip control – such as\nestablishing a standard lapel-and-sleeve grip – before attempting throws. One Reddit judoka advised\na BJJ crossover athlete: “Grips change the dynamic a lot. Look up grip fighting... it’s a good start.”.\nGood gripping involves posture too: keeping your elbows in, using your grip to off-balance the\nopponent, and breaking their grips on you. Judoka learn techniques like sleeve stripping, cross-\ngripping to break an opponent’s hold, and moving immediately after gripping (since grips are only\nas good as what you do with them). High-level judo becomes almost a chess match of grip\nexchanges – hence the emphasis at all levels on this foundational skill.\nKazushi (Off-balancing) and Throws: Judo’s core is throwing techniques, but a successful throw\nrequires kazushi – unbalancing your opponent. Coaches drill judoka to create kazushi through pulls,\npushes, and body movement. For instance, before throwing with ippon seoi-nage (shoulder throw),\none might tug the sleeve forward and upward, pulling the opponent onto their toes. Beginners often\n52\n• \n20\n• \n53\n54\n• \n10\n\nstruggle by trying throws without setup; hence instructors constantly emphasize “set your opponent\nup.” One practical drill is to have uke (the partner) just resist statically while tori (the thrower) figures\nout how to make them step or lean – teaching that you can’t throw a stable partner without first\nbreaking that stability. A sage judo saying: “Kuzushi, Tsukuri, Kake” – off-balance, entry, execution. This\nreminds judoka that a throw is a three-part process, with off-balancing first. As mentioned earlier, a\nReddit coach suggested an exercise: attach to a similar-sized partner and “try to move him all over the\nmat just by moving yourself while connected”, without muscling. This exercise ingrains how to use\nbody movement and connection to off-balance someone – essentially teaching finesse over brute\nforce in throws. When it comes to execution of throws, coaches highlight rotation and\ncommitment. For many throws (like hip throws or foot sweeps), you have to fit in fully and commit\nyour hips or sweep decisively once you feel the opponent’s weight is shifted. Half-hearted attempts\noften fail or get countered. Thus, “when you go, go.” Judoka practice entries (uchikomi) repetitively to\ndevelop speed and timing for that moment of commitment. Combination throwing is another tactic:\nif one throw is resisted, immediately transition to another that takes advantage of the opponent’s\nreaction (e.g., attempt osoto-gari, opponent leans back, transition to kouchi-gari inside). Coaches will\nteach common combinations and encourage fluid thinking rather than insisting on one throw\nagainst resistance.\nTransition to Newaza (Groundwork): Although judo is primarily focused on standing throws,\ngroundwork (newaza) is also scored (pins or submissions). However, referees in judo give limited\ntime on the ground; you typically have only a few seconds to show progress or you’ll be stood up.\nTherefore, judo groundwork strategy is quick and decisive. A judo coach will advise practicing rapid\ntransitions: the moment you throw or get thrown and it goes to ground, immediately flow into a pin\nor submission attempt. For example, off a throw that doesn’t score ippon, a judoka might instantly\ngo into a hold-down (osaekomi) like Kesa-gatame (scarf hold). In training, judoka do drills where they\nthrow and follow through into a pin, or start in common ground positions (like turtle, since many\nthrown opponents end up turtled) and work to flip and pin them. Pins (holding an opponent on their\nback) can win a match if maintained ~20 seconds, so controlling positions like side control (yoko-\nshiho-gatame) and mount (tate-shiho-gatame) is drilled. Submissions (armlocks and chokes) are\ntaught too – notably the armbar (juji-gatame) from various positions and the clock choke or lapel\nchokes on a turtled opponent. But because of the short ground time, judo advice is often to focus\non getting a quick submission setup or securing a tight pin immediately. If something doesn’t latch on\nin a few seconds, referees might stand you up. Consequently, judoka are trained to be explosive\nand assertive in newaza – the opposite of the more patient BJJ style. An anecdotal piece of advice:\n“Don’t play guard in judo – use newaza only to finish what your throw started.” There are exceptions\n(some players specialize in groundwork), but by and large, judo strategy prioritizes stand-up and\nuses groundwork opportunistically.\nRules and Tactical Shifts: Judo’s rules have changed over time (e.g., leg grabs were banned in 2010),\nand tactics shift accordingly. Current judo advice includes avoiding penalties: grip fighting too\ndefensively or refusing to attack can earn shido penalties. Coaches emphasize activity – even if\nyou’re ahead, you must grip and attack to some degree to avoid penalties. Tactically, if leading, a\njudoka might grip more defensively and attack with low-risk throws to burn time, but they can’t\noutright stall. Another rule nuance: golden score (overtime) – conditioning matters since matches\ncan go long if no score; judoka train mental focus to not make a mistake in golden score due to\nfatigue. Also, judoka must be aware of scoring: an ippon (full point) ends the match, waza-ari (half\npoint) are accumulated. Thus, if you’ve scored one waza-ari, you might tactically go a bit more\n49\n• \n• \n11\n\nconservative to protect the lead (since two waza-ari equal a win). Conversely, if behind, you know you\nneed to push for a big score. Coaches simulate these scenarios in training – e.g., one student is\n“down by waza-ari” and has 30 seconds to throw, the other tries to defend smartly without getting\npenalized. Edge play: Using or avoiding the edge of the mat is also a tactic (stepping out can incur\npenalties now). Good awareness of mat space is taught – e.g., if being thrown, savvy players might\ntry to escape off the mat to negate a score, though rules penalize obvious escaping. All these finer\npoints mean judo athletes must train not just technique but situational strategy. \nTraining Intensity and Randori: Judo randori (sparring) tends to be high-intensity, akin to stand-up\nwrestling with throws. The old-school judo approach involves a lot of hard randori to toughen\nathletes and improve timing. Coaches often advise training with partners of varying styles: fight\nthe fast, lighter guys to work on speed and defense against tomoe-nage (sacrifice throws), fight the\nheavy, strong guys to work on grip strength and big throws, etc. This mirrors the saying, “If you want\nto be a lion, train with lions.” Grappling communities often mention that to improve, you should seek\nout partners who challenge you – this applies equally in judo. Because judo involves impact\n(throws to the ground), a practical tip is to take care of your body – e.g., learn proper breakfalls (as\nmentioned) and do conditioning to handle the strains. Judoka often have strong cores and necks\nfrom bridging and breakfalling, and coaches include exercises like neck bridges, tumbling, and\nbalance drills to support this. \nUnique Judo Conditioning: Judo players incorporate conditioning that mimics throwing. Interval-\nstyle training such as uchikomi intervals (e.g., 30 seconds as many fit-ins as possible, 30 sec rest,\nrepeat) builds specific endurance. Grip endurance is huge: exercises like towel pull-ups or timed\nhangs from the gi are common to simulate tired grips in a match. Some coaches have athletes do\ncircuits that alternate throws with push-ups or rope climbs – reflecting the upper-body endurance\njudo demands. Explosive power in the legs and hips is developed with plyometrics (box jumps, etc.)\nbecause a throw is an explosive hip extension. Flexibility drills, particularly for high kicks (for throws\nlike uchi-mata) or deep squats (seoi-nage), are also in judoka routines. So while general athletic\nadvice covers a lot, judo-specific conditioning zeroes in on grip, explosive throws, and the ability to\nrepeat efforts with short recovery (since a match might have many exchanges).\nIn essence, judo-specific advice centers on grip and throw. Win the grips, set up the throw, commit fully,\nand follow through to the pin or submission. Maintain composure under the pressure of the clock and\npenalties, and use superior technique and timing to send your opponent airborne. Judo has a saying: “Force\nyour opponent to make the first move – if it is a poor one, capitalize; if it is a good one, have a counter ready.”\nThus, combination and counter throws are taught. Finally, judoka are reminded to cultivate a strong spirit –\nmuch like wrestling, judo can be very demanding, and the student must learn to push past discomfort\n(whether grip fatigue or the sting of being thrown hard). The bowing and respect culture in judo reinforce\nhumility: you get thrown, you get back up and continue. That resilience is key to progress in judo’s steep\nlearning curve.\nBrazilian Jiu-Jitsu (BJJ)\nPositional Hierarchy and Guard: BJJ is unique in that fighting off your back (guard) is an integral\npart of the art. A core strategic concept is the positional hierarchy – generally: back mount (with\nhooks) is most dominant, then mount, then side control, then half guard, then guard (which can be\nneutral or defensive depending on skill), with inferior positions being those where your opponent is\n• \n55\n• \n• \n12\n\ncontrolling you (e.g., you are mounted or they have your back). Coaching in BJJ places heavy\nemphasis on advancing position and guard work. Beginners are often told to “get comfortable in\nguard” – both playing guard (attacking from bottom) and passing guard (from top). For new\nstudents, one key piece of advice is to focus on escapes from bad positions (mount, back, side\ncontrol) before trying fancy submissions. As the saying goes, “A black belt is a white belt who has\nescaped mount thousands of times.” In practice, if you cannot survive when someone mounts you, it\nwon’t matter that you know five armbar setups. Thus, BJJ coaches teach escapes (upa escape and\nelbow-knee escape from mount, shrimping from side control, etc.) very early. Renowned instructor\nSaulo Ribeiro in Jiu-Jitsu University even outlines that white belts should prioritize survival and\nescapes. Community advice echoes this: “Learn to defend and regain guard first, then attacks will\ncome.” By building a solid defense, you gain confidence rolling with anyone. Simultaneously, learning\nan effective guard is crucial. The guard is often called the “foundation of BJJ.” Beginners typically\nstart with the closed guard (legs wrapped around opponent). They learn attacks like the cross collar\nchoke or armbar from closed guard, but more fundamentally, they learn to break an opponent’s\nposture and control them from guard. Only with posture broken can one attack or sweep. In\nmodern BJJ, there are many guard types (open guards like De La Riva, half guard, etc.), but a\ncommon coaching approach is to give a student one or two guard styles to focus on that fit their\nbody and game. For instance, a flexible person might develop a good closed guard and triangle,\nwhereas a shorter stocky person might prefer half-guard sweeps. The overarching advice is to have\na guard you can rely on – a way to prevent passes and initiate offense from bottom. On the flip\nside, passing guard (getting around the opponent’s legs) is considered one of the hardest skills.\nCoaches stress fundamentals here: a stable posture when in someone’s guard, good base\n(balancing weight to not get swept), and strategic pressure. Classic passes like the knee-cut, smash\npass, or toreando are taught early, as they instill principles of guard passing (either going through,\nunder, or around the legs). Positionally, the top player aims to progress: pass the guard -> secure\nside control -> maybe go to mount -> then take back or submit along the way. The bottom player\naims to either submit from guard or sweep (reverse positions) to get on top. In sport BJJ, a sweep\ngives points and is often a gateway to passes. So a lot of BJJ advice is about connecting positions:\ne.g., use a sweep to come on top directly into a guard pass, or if you mount and they roll, transition\nto taking the back. This fluid positional game is drilled via specific sparring (e.g., guard passing drills\nwhere you switch after a pass or sweep).\nRelaxation and Breathing: A distinctive piece of advice in BJJ, frequently mentioned on forums and\nby coaches, is “relax and breathe.” Beginners tend to grapple with excessive tension – every muscle\nflexed, burning energy quickly. Experienced grapplers appear more relaxed, only exploding when\nnecessary. Staying calm and conserving energy is highly valued in BJJ’s longer rounds (commonly 5-\nminute plus in sparring, up to 10 minutes in competition for higher belts). One reason is that an\nadrenaline dump or sudden exhaustion can lead to mistakes and getting caught. So instructors\nremind students to control their breathing – for instance, exhale when escaping tight positions to\navoid panic, or take slow breaths when in a static position like closed guard. A typical scenario: a\nnewcomer holds their breath while trying to escape mount, quickly gassing out. A coach would\nadvise them to take small breaths, stay calm under pressure, and methodically work the escape.\nThere’s even a saying, “Flow with the go,” encouraging a relaxed responsiveness rather than stiff\nresistance. Being relaxed also helps you feel the opponent’s intentions (sense their weight shifts) and\nreact more fluidly. Many BJJ schools incorporate drills where one person goes light and fluid to\nencourage relaxation. Additionally, by staying loose, you can transition faster – tension often slows\nmovement. An example of this principle is when playing guard: if you over-grip and tense up, a\n• \n13\n\npasser can feel it and redirect your force; but a relaxed guard player can quickly switch grips or hip\nmovement as the situation changes. Experienced grapplers might even appear to be resting\nmomentarily in certain positions to recover while the opponent struggles. Learning where you can\nsafely rest (e.g., in your closed guard or when you have someone’s back with a body triangle) is part\nof BJJ strategy. In short, energy management is a skill: use strength in bursts when needed (e.g., a\ndecisive bridge escape or a submission finish), but not continuously. One Reddit thread of advice to\nnewbies had a top comment: “roll with your partner, not against them” – meaning don’t treat every\nroll like life-or-death struggle, instead treat it as a learning exchange. This mindset fosters relaxation\nand better technical growth.\n“Tap Early, Tap Often”: Safety in training is a point of emphasis in BJJ culture. Because BJJ allows\ndangerous joint locks and chokes, the understanding is that training partners rely on each other to\ntap out or release in time. Beginners especially get the advice “There’s no shame in tapping” – it’s\nhow you learn. If you refuse to tap and get injured, you might be out for weeks (or worse). Thus, new\nstudents are told to drop the ego: “If you’re caught, tap and reset.” Tapping early (before a joint\nlock is fully extended or a choke is fully sunk) prevents injury. This also psychologically helps one\nprogress – you learn to experiment without fear, knowing you can tap if it fails. Moreover, every tap is\na lesson; you figure out what mistake led to getting caught. Higher belts often share that they too\ntapped countless times to get where they are. In some gyms, it’s joked that “your goal as a white belt\nis to tap 1000 times – after that, you’ll be a blue belt.” The corollary advice for the person applying\nsubmissions is control and care. Cranking submissions as fast as possible is frowned upon. For joint\nlocks like armbars or heel hooks, applying pressure slowly and controlled gives the opponent a\nchance to tap (especially in training – competition might differ). For chokes, one can apply gradually;\nchokes can come on fast, but since they’re generally safe (they cause a tap or someone goes\nunconscious but not permanent injury if released), people may apply them more assertively than\njoint locks. Nonetheless, even with chokes, if your partner isn’t tapping but you feel it’s sunk, you\nmight ease to check (some newbies don’t know when to tap). Communication is key – another piece\nof advice: “communicate with your training partners.” If something hurts or if you’re caught, tap\nvisibly and maybe verbally. Training is cooperative to an extent – you’re not opponents in the gym,\nyou’re teammates. This cooperative mindset is strongly ingrained in BJJ, partly because many\npractitioners train well into their 40s, 50s, and want longevity. One practical tip is “Tap before it hurts,\nnot after.” That slight ego check prevents countless injuries. \nAsking Questions and Learning: BJJ gyms often foster an open learning environment. Students are\nencouraged to ask questions about techniques they don’t understand or situations they encounter\n. A good coach will explain details or troubleshoot why a move isn’t working. This is a bit different\nfrom some traditional martial arts where questioning was less common – in BJJ, problem-solving and\nexperimentation are part of the culture (likely due to its sportive nature). A common beginner\nmistake is to stay quiet and confused – instead, seniors advise: “If you keep getting caught in\nsomething, ask the person or a coach how to defend it.” The community is generally very willing to\nshare knowledge. Likewise, studying outside of class (watching instructionals, matches, YouTube\nvideos) is common in modern BJJ. Coaches might give study recommendations or at higher levels\nexpect students to take ownership of learning specific positions. However, with the deluge of online\ntechniques, another advice is to focus: don’t try to implement 10 new moves at once; incorporate\none thing at a time into your game. So a coach might say, “This month, focus on escaping side control\nand maybe add one guard sweep to your arsenal.” This structured, focused approach prevents\noverwhelm. \n• \n51\n• \n56\n14\n\nDeveloping a Game Plan: As students advance, they’re encouraged to play to their strengths and\ndevelop a personal game. BJJ is very individual – different body types and attributes lend themselves\nto different styles (e.g., a tall lanky person might excel at triangle chokes and a variety of open\nguards, whereas a shorter heavy person might favor pressure passing and mount attacks). A purple\nbelt and above often has a “A-game” sequence: for example, pull guard -> get a De La Riva hook ->\nberimbolo to back -> finish with a choke, or alternatively, takedown -> pass guard -> collar choke\nfrom mount. Coaches help students discover and refine these sequences. In competition, having a\ngame plan is vital: know whether you want to start standing or pull guard, have a combo of\ntechniques you’re best at, and have counters ready for common defenses. One BJJ black belt’s advice\nto competitors: “impose your game – don’t play your opponent’s game.” That means if you’re a top\nplayer, aggressively pursue the takedown and passing instead of accepting guard, and vice versa.\nBecause BJJ offers many guard types and positions, part of game planning is also deciding what not\nto do – e.g., if you’re not a flexible inverted guard player, maybe avoid positions like inverted guard\nor deep half that could entangle you. In training, this translates to specific sparring in your target\npositions to sharpen them. For instance, if your plan is armdrag to back take, you’ll drill armdrags\nand rolling back-takes extensively. Higher-level advice also covers studying opponents (if known)\nand analyzing one’s own past matches for mistakes – though at local levels, BJJ folks usually focus on\ntheir own game development rather than opponent-specific prep.\nCompetition Mindset and Rules: BJJ competition has its own strategies. One is points awareness –\nknowing the IBJJF (or relevant org) point scoring and advantages. Competitors are coached to secure\npoints when possible (e.g., after a sweep, stabilize 3 seconds to get the points before moving on) and\nto not give up points cheaply (e.g., fight grips and pulls to not concede a takedown). If up on points\nnear the end, strategic stalling (while appearing busy to avoid stalling calls) sometimes happens –\nthough too much stalling gets penalized. A common piece of competition advice: “If you’re down on\npoints, you must chase the finish.” Many matches see someone down on points desperately hunting a\nsubmission in the final minute – because points alone can’t be caught up without a sweep or pass,\netc. Thus, understanding the scenario (am I down 2 points? tied but losing an advantage? etc.) is\nimportant. Coaches often shout instructions related to this (“You’re up by 2, keep the position!” or\n“You need a sweep, 30 seconds!”). Preparing for this, some instructors run practice matches in the\ngym with points and refs to simulate the pressure. Additionally, tournament day advice includes\nwarm-up properly, stay hydrated, and manage adrenaline. BJJ athletes often practice breathing\nand visualization (discussed earlier) before matches to stay calm. Many treat the first match as the\nhardest due to nerves; once that’s done, they find a flow. \nSelf-Defense vs Sport Perspective: Depending on the gym, some advice might be tailored to self-\ndefense application of BJJ (since BJJ has roots in vale tudo and street fighting). For example, keeping\nyour head safe from strikes, using punches in ground and pound – these are not sport concerns but\nself-defense ones. A self-defense focused coach might advise: “On the street, avoid going to the\nground if possible; but if you do, get on top.” They’ll emphasize standing techniques and defensive\ntactics against common attacks. In contrast, a sport-oriented coach may never mention those\naspects and focus purely on grappling moves. It’s worth noting the difference – some community\ndebates revolve around “sport BJJ vs self-defense BJJ.” For our purposes, within training advice, just\nknow that gyms can differ in emphasis. But the core grappling advice overlaps significantly (position,\ntechnique, leverage hold true in either case). \n• \n• \n• \n15\n\nIn summary, Brazilian Jiu-Jitsu advice highlights technical finesse, patience, and strategic thinking on\nthe ground. BJJ is often called “the gentle art” because ideally a smaller person uses it to negate size\nadvantages of an opponent through superior technique. Key pointers are to maintain positional control, \nuse leverage, conserve energy, and stay mindful during rolls. BJJ’s learning journey is long (often 10+\nyears to black belt), so coaches remind students to enjoy the process – “embrace the grind and the joy of small\nimprovements.” Practical community tips like “keep a training diary,”“drill that sweep until it’s second nature,”\nand “don’t compare yourself to others, just be better than yesterday,” all feed into a healthy progression. BJJ’s\nculture of mutual respect (e.g., bowing or handshakes, calling higher belts “professor” or by first name\nrespectfully) and camaraderie means that much advice also involves helping each other – e.g., higher belts\noften take time to teach beginners, and beginners are encouraged to ask them (which also flatters the\nhigher belts and reinforces their knowledge). The result is a community where learning is continuous and\ncollective, which is one of BJJ’s strengths as a martial art and sport.\nMental and Tactical Preparation (Mindset, Strategy, Competition\nPsychology)\nGoal Setting and a Growth Mindset: Mental preparation in grappling starts long before stepping\non the mat for competition. Athletes are encouraged to set clear goals – both short-term (e.g.,\nimprove a specific skill, win a local tournament) and long-term (e.g., earning a black belt, becoming a\nnational champion). Having concrete goals gives direction to training and helps motivation.\nCoaches often work with athletes to ensure goals are realistic and focused on improvement rather\nthan just outcomes. For instance, “execute 3 solid takedown attempts each match” is a process goal\nwithin the athlete’s control, whereas “win gold” is outcome-oriented. A systematic review on BJJ\nnoted that competitive level didn’t necessarily change aerobic fitness, implying that progress comes\nfrom technical and experiential growth as much as raw physical changes – a reminder that\nconsistent effort and learning lead to improvement. Maintaining a training journal is a widely\nsuggested practice (in BJJ particularly) to track what you learned, note rolling feedback, and ensure\nyou’re progressing. This ties into a growth mindset: viewing every training and competition as a\nlearning experience. A common mental reframing is to treat losses or taps as lessons – instead of\nfeeling defeatist, ask “what did I do wrong? how can I improve?” Athletes who adopt this mindset\nremain more resilient and motivated. They focus on personal development (e.g., improving their\nweakness in guard passing) rather than just comparing themselves to others or chasing external\nvalidation. This mindset was evident in community advice like, “The belt color isn’t the goal; the goal is\ngetting better – the belt is just a recognition of that”. In wrestling, similarly, coaches instill that\neach match, even a loss, is experience in the bank – e.g., wrestling many matches in the off-season\nto gain mat time. Curiosity and willingness to learn are encouraged: ask why a technique works,\nseek feedback, and be open to new ideas. Notably, advanced grapplers remain students of the game\n– they might attend seminars, study footage, and continue refining basics. This eternal learner\nattitude keeps one’s mind engaged and prevents stagnation.\nMental Toughness and Resilience: Grappling sports are tough – you will be physically and mentally\ntested. Mental toughness refers to staying composed, determined, and confident under pressure.\nSports psychology research in combat sports suggests that mentally tough athletes experience\nlower levels of competitive anxiety and higher self-confidence before matches. In practical\nterms, a wrestler with mental toughness will not break when down on points or when fatigued; a\njudoka will continue attacking in golden score despite exhaustion; a BJJ fighter will stay calm even in\n• \n5758\n15\n59\n5758\n• \n60\n16\n\na bad position, believing they can escape. Coaches build mental toughness through challenging\ntraining – pushing athletes beyond their comfort zones so that they learn they’re capable of more\nthan they thought. For example, wrestling practice might include intense sparring after fatigue sets\nin (teaching athletes to wrestle tired). A saying, “Train hard, fight easy,” implies that if you’ve endured\nhell in the practice room, the actual match feels manageable. However, mental toughness isn’t just\nmacho aggression – it’s also emotional control and focus. A study on judo highlighted the\nimportance of confidence and emotional control at elite levels. Being able to manage\nfrustration (e.g., when an opponent counters your best move) and instantly refocus on the next\nplan is a trait of champions. Athletes use various techniques to cultivate this: some do self-talk,\nrepeating affirmations like “I’ve been here, I’m prepared” to stay confident. Others use pressure\nsimulation, e.g., rolling with a fresh partner every minute (shark tank) to induce mental stress and\nlearning to cope. In competition, a mentally tough grappler is the one who, as Dan Gable’s quote\nsuggests, wins the “third period” with heart – meaning when skill and conditioning are equal,\nsheer will and refusal to quit makes the difference. That “heart” is essentially resilience: maybe you’re\ndown on points or getting dominated early, but you don’t mentally give up – you stay in the fight and\nlook for opportunities to turn it around. Countless comeback stories in grappling come from athletes\nwho kept their composure and will. \nOne practical piece of advice is not fearing failure. In training, tapping or getting thrown is normal –\nmentally tough athletes don’t see it as humiliation, but as part of the process. In competition, fearing a loss\ncan make you fight timidly, so coaches encourage embracing the challenge and being willing to risk bold\nmoves to win. “Play to win, not just to not lose,” as they say. Building that mindset can involve competition\nsimulations, or even frequent competition entry to desensitize the athlete to the nerves of big events. Over\ntime, facing these stresses routinely makes them less intimidating. \nVisualization and Mental Rehearsal: Many athletes use visualization techniques as part of\nmental prep. This involves vividly imagining scenarios – from the ideal performance to potential\ndifficulties – and seeing oneself succeed. Grapplers might visualize executing their game plan: a\njudoka visualizes gripping and throwing ippon, a wrestler sees themselves getting the takedown and\nhaving their hand raised, a BJJ fighter imagines securing the submission. Visualization can also cover\nhow to deal with adversity: for example, picture being taken down and behind on points, then\nmounting a comeback. This practice builds a sense of familiarity and confidence. As one BJJ coach\nnoted, mental visualization of techniques and handling challenges with calm can enhance\nperformance. Indeed, scientific research supports that mental imagery can improve motor\nperformance and reduce anxiety. Before competitions, some athletes find a quiet space and run\nthrough these mental movies. An added element is sensory detail – e.g., imagining the feel of the\ngrips, the sound of the crowd or ref, the fatigue in the legs, and then imagining pushing through it.\nThis helps prevent sensory overload during the actual event. \nAnother mental practice is meditation or mindfulness. This trains one to stay present and let go of\ndistracting thoughts. A number of fighters (especially in MMA/BJJ) swear by mindfulness meditation to\nimprove focus. For instance, Ryan Loder, a wrestler-turned-MMA fighter, mentioned adding meditation and\njournaling to his routine to enhance present-moment focus. Mindfulness can help grapplers avoid the\ntrap of worrying about “what if I lose” or ruminating on past mistakes mid-match. Instead, they learn to\nquickly refocus on the immediate task (e.g., “hand fight for that underhook now”). Breathing exercises are\ncommonly taught as well: taking slow, deep breaths to control physiological arousal. Before a judo match,\nyou might see players bounce to stay warm but also take a couple deep breaths to steady their nerves.\nCombat athletes often talk about achieving a “flow state” – a mental state of energized focus and immersion\n6162\n20\n• \n6364\n65\n17\n\nwhere action and awareness merge. Practices like visualization and mindfulness increase the likelihood of\nentering flow under pressure by reducing anxiety and enhancing concentration.\nCompetition Strategy and Game Planning: Tactics can vary by discipline due to different rules, but\nsome universal strategic advice applies. “Fight your fight” is a phrase across all sports: implement \nyour game plan rather than reacting to the opponent’s game. This might mean aggressively\npursuing a takedown if you’re a wrestler, or guard-pulling immediately if you’re a BJJ guard expert.\nKnowing the rules is step one – a BJJ competitor must know how advantages work, a judoka must\nknow what grips or leg grabs are illegal, a wrestler must know how passivity is called, etc.\nUnderstanding the scoring allows smart strategic decisions. For example, a judoka ahead by a waza-\nari will know to perhaps avoid risky moves that could get them counter-thrown for an ippon. A\nwrestler in freestyle who leads will know giving up a step-out (1 point) is better than exposing their\nback (2 points) so they might intentionally step out when in danger. These are nuanced choices that\ncome from rules knowledge. \nTime management is another tactical element. Grapplers are taught to be aware of the clock and match\nsituation. For instance, if time is running out and you’re behind, you may need to go high-risk, high-reward\n(e.g., attempt a submission or big throw even if it might fail). Conversely, if you’re winning, you might\nmanage the clock – not stalling blatantly, but perhaps slowing the pace, tying the opponent up, or staying\nin a safe position. BJJ coaches, for example, might advise a student up on points to maintain top control and\nnot give space for a scramble in the final minute. Wrestling coaches might yell at a winning wrestler to\n“circle, circle!” to avoid engaging in a risky position in the last seconds. \nAdapting mid-match: A prepared athlete has Plan A, but also Plan B or C if things go awry. Mike Tyson’s\nfamous quote, “Everyone has a plan until they get punched in the face,” adapted to grappling could be “...until\nthey get exhausted or their favorite move fails.” A well-rounded grappler can switch strategy – for example,\nif you can’t take down a judo opponent, perhaps pull guard (if allowed) or focus on counter-throws instead.\nIf your armbar isn’t working on this BJJ opponent, switch to a sweep and try a choke from top. This\nadaptability comes from training a broad skill set and sparring lots of different styles. Coaches sometimes\nintentionally put athletes in bad situations in training – e.g., start rounds with you in a choke or armbar – to\ntrain the ability to stay calm and escape. That way, if it happens in competition, you don’t panic and you\nexecute your escape (muscle memory + mental composure).\nCornering and listening: In competition, grapplers often have coaches yelling advice from the side. A good\ncompetitor learns to tune in to their coach’s voice and follow instructions when appropriate. This is a\nmental skill of its own – not getting so tunnel-visioned that you can’t heed a crucial tip (“30 seconds left! You\nneed to pass guard now!” or “watch out for his triangle!”). Practicing this during training (having coaches or\nteammates shout pointers) can help. \nComposure and Emotional Control: Staying emotionally composed is critical. Emotions like anger,\nfrustration, or panic can lead to errors. A frustrated wrestler might shoot recklessly and get\ncountered; an angered judoka might telegraph a big throw and get sidestepped. BJJ, being slower,\ncan breed frustration if you’re stuck in someone’s guard – but panic can make you open to sweeps or\nsubmissions. Thus, a lot of mental training is about emotional regulation. One study noted elite\njudoka benefit from emotional control in performance. Techniques to control emotions\ninclude deep breathing (already mentioned), positive self-talk (“Stay cool, I’ve been here”), or using\na routine to reset (some smack their face lightly, or do a quick adjustment of gi or headgear – small\n• \n• \n6166\n18\n\nrituals to gather themselves). A tip often given is “If you get caught in a bad spot, don’t panic –\nmethodically work your defense.” This is drilled by positional sparring: e.g., escape side control drills\nteach you to follow steps rather than thrash about (which only wastes energy and could worsen the\nposition). \nAnother emotional aspect is confidence vs. anxiety. Pre-fight nerves are normal – even world champions\nsay they feel butterflies. The goal isn’t to eliminate nerves but to manage them. Some coaches have\nathletes do a consistent warm-up routine at tournaments to get in the zone – familiarity breeds calm. They\nmight listen to certain music, do specific drills, etc., as a form of “activation ritual.” Grapplers also often\nremind each other that “the other guy is human too” to reduce intimidation. In judo or wrestling, facing a big\nname can psyche you out; good coaches will downplay that and focus the athlete on their own strengths\nand tactics. \nSportsmanship and mindset: Interestingly, research found grapplers with more sportsmanlike attitudes\n(respect for rules and opponents) sometimes reported higher anxiety. This could be because they\nput pressure on themselves to uphold certain standards. The takeaway for mental prep is perhaps a\nbalance: care about winning and doing things right, but don’t let the weight of expectations cripple you.\nSome athletes use perspective: remembering that you do this sport for fun or personal growth can relieve the\ndo-or-die feeling. As Renzo Gracie famously said about BJJ, “In the end, it’s just a roll on the mat – enjoy it.” A\nrelaxed yet focused mindset often leads to best performance.\nSupport Systems and Coaching: Behind every grappler is usually a team – coaches, training\npartners, maybe family – forming a support system. Mentally, knowing you have people in your\ncorner boosts confidence. Dan Gable highlighted the importance of surroundings: “My advice to\nyoung wrestlers is that your surroundings really make a difference. Put yourself in good, positive\nsurroundings.”. This means training with people who push you but also believe in you. Grapplers\nare advised to choose training partners and coaches wisely – ones who encourage growth (and\nnot those who, say, injure you or demoralize you constantly). In the gym, higher belts mentor lower\nbelts, creating a culture where everyone improves. Taking advantage of that – asking questions,\ngetting feedback – was mentioned earlier and is part of mental preparedness (intellectual humility to\nask for help leads to improvement). On the flip side, helping others can also reinforce your own\nknowledge and confidence. Ryan Loder noted that coaching younger wrestlers in his gym not only\ngave back to the community but also improved his own game and confidence going into fights.\nThe adage “the more you give, the more you receive” holds – teaching a technique clarifies it in your\nown mind. \nAdditionally, in terms of mental health, a supportive environment is crucial. Combat sports can be intense,\nand athletes sometimes struggle with the psychological strain (cutting weight, constant competition, etc.).\nModern coaching encourages discussing mental health openly – seeking professional help if needed, using\nsports psychologists, etc. Loder’s emphasis on removing stigma for mental health in fighters is a sign of\nchanging times. The mentally strongest athletes are often those who take care of their overall well-\nbeing – balancing intense training with proper rest, hobbies, and support from friends/family to avoid\nburnout. \nAdaptability and Analysis: After competitions, strong-minded athletes and coaches will analyze\nperformance rationally. Win or lose, they look at what can be improved. This iterative approach –\nplan, execute, review, adjust – is a tactical mental skill. It prevents plateauing because you’re always\nlearning from experience. A BJJ competitor might note they struggled with opponents pulling guard\n6067\n• \n68\n69\n6965\n• \n19\n\nand plan to work more passing. A wrestler might realize their underhook series wasn’t effective\nagainst left-handed stance opponents and seek new setups. Being honest in self-assessment\n(without being too negative) is key. That’s why journaling or video review is advised: the data doesn’t\nlie, and you can pinpoint issues. \nIn summary, mental and tactical preparation for grappling sports blends sports psychology, smart game-\nplanning, and the cultivation of a resilient, focused mindset. Common themes include: \nConfidence through preparation: knowing you’ve done the work so you can trust yourself in\ncompetition.\nCalm under fire: using breathing, visualization, and experience to stay composed and think clearly\nduring a match.\nAdaptive strategy: being prepared but flexible, ready to seize opportunity or adjust if things go\nawry.\nRelentless yet controlled aggression: especially in wrestling and judo – impose your will but don’t\nlose technical control or awareness.\nLove of the game: perhaps the most important mental aspect. The best grapplers often simply love\ngrappling – this passion carries them through brutal trainings and tough losses. Maintaining that\nsense of fun or at least deep satisfaction in the grind is crucial for longevity and success. As many\nsay, “Enjoy the journey”. A grappler who is curious and enjoys learning will, in the long run, outlast\nand outperform those who only grit their teeth through misery. \nBy prioritizing both physical preparation and mental training, grappling athletes can develop the full\npackage: technique, athleticism, and the mindset of a champion. Each discipline might phrase the advice\ndifferently – an old judo master might speak of calm zen mind, a wrestling coach might talk of hard work\nand heart – but they all point to the fusion of skill and will. With high-quality training, smart coaching, and\nthe collective wisdom of the community, today’s grapplers are improving faster and achieving more than\never, all while honoring timeless principles of combat. The key is to take this advice, apply it earnestly, and\nremain a student of the art throughout your journey. With that approach, excellence in grappling – be it\nwrestling, judo, or BJJ – becomes an attainable and rewarding goal.\nSources:\nAndreato et al. (2017). Physical and Physiological Profiles of Brazilian Jiu-Jitsu Athletes: a Systematic\nReview. Highlights the low body fat, aerobic capacity, and strength characteristics important for BJJ\n.\nJohn Timar (2024). The Unique Physical and Mental Demands of Grappling Sports – GrappleScience\nJournal. Emphasizes the combination of strength, endurance, flexibility, and mental acuity needed in\nBJJ, judo, and wrestling, as well as the value of tailored strength & conditioning and mental\nskills like visualization.\nStrengthLog – Strength Training for Judo: Guide & Training Program. Describes modern judo’s adoption\nof strength training for improved performance, including benefits like power, grip strength, and\ninjury prevention.\nReddit r/judo discussion (user comments, 2013): Advice to a BJJ player starting judo – focus on\nlearning grip fighting and kuzushi before worrying about throws.\n• \n70\n• \n7065\n• \n• \n• \n• \n1571\n• \n141\n262\n• \n437\n• \n5450\n20\n\nYalcin Sucu (2023). 10 Tips for Beginners in BJJ – Roger Gracie Academy Blog. Emphasizes patience,\nfundamentals (escapes, sweeps), consistency in training, relaxed rolling, and tapping early to\nlearn safely.\nSeidler R. Ziser (2024). BJJ Ultimate Guide for Beginners – Gracie Barra Blog Series. Discusses goal\nsetting, journaling, mental resilience and visualization in BJJ, as well as physical prep\ntips (strength, endurance, mobility) and the principle of leverage over brute force.\nNSCA (2022). Developing Agility and Quickness for Wrestling (Human Kinetics excerpt) – Notes that\nwrestling requires superior stamina, strength, speed, agility; advocates training multi-directional\nmovement and quickness when fresh.\nZach Even-Esh (n.d.). Special Strength Training for Wrestlers. Stresses that wrestling conditioning is\nbest developed via actual wrestling drills, and that basics win at elite levels (e.g., Olympic finals\ndecided by fundamental moves).\nDan Gable quotes (BrainyQuote). Example: “The 1st period is won by the best technician. The 2nd period\nby the kid in the best shape. The 3rd by the kid with the biggest heart.” – underlining the roles of\ntechnique, conditioning, and mental toughness in wrestling.\nDara Mojtahedi et al. (2023). Competition Anxiety in Combat Sports and Mental Toughness – Front.\nPsychol. study. Found that higher mental toughness correlates with lower pre-competition anxiety\nand higher self-confidence in combat athletes, supporting the value of mental training\ninterventions.\nLauren Keating (2025). UFC Fighter Ryan Loder Shares Advice for Wrestlers, Stresses Mental Health –\nSportStars Magazine. Describes Loder’s training insight that total commitment and treating training\n“as your job” is needed to reach elite levels, as well as his inclusion of meditation and outreach on\nmental health for athletes.\nJiujitsu-News.com (2024). Jiu-Jitsu Quotes: Wisdom and Inspiration from the Mats. Contains Renzo\nGracie & John Danaher’s quote on technique over strength and the classic “Position Before\nSubmission” maxim explained, reflecting fundamental BJJ philosophy.\nEvolve MMA (2020). Rest and Recovery for BJJ – Evolve Daily Blog. Emphasizes that rest, sleep,\nhydration, and taking days off when needed are vital to keep training performance high and\nprevent overtraining injuries.\nScience for Sport (2025). Injury Prevention Warm-up in Grappling Sports – Jon Bell. Highlights that\ntailored warm-ups can reduce injury rates in wrestling, BJJ, judo, and notes common injury\nmechanisms (throws/takedowns leading cause), advocating an evidence-based approach to\ngrappling warm-ups.\nReddit r/bjj threads (various). Community advice such as relaxing during rolls, not worrying about\nwinning in the gym, and leaving ego at the door are frequently upvoted tips, aligning with the points\ncited above on staying calm and tapping when caught (e.g., user posts summarized in).\n• \n4140\n51\n• \n57586364\n47\n• \n1672\n• \n7342\n• \n20\n• \n60\n• \n7465\n• \n44\n45\n• \n3234\n• \n3536\n• \n7551\n21\n\nThe Unique Physical And Mental Demands of Grappling Sports –\nGRAPPLE SCIENCE\nhttps://grapplescience.com/blogs/journal/the-unique-physical-and-mental-demands-of-grappling-sports?\nsrsltid=AfmBOorMlNrvC1gfn0Ax-okCZpzIUJQ6wO6mpZwOcEajmNnMKFquTNmu\nStrength Training for Judo: Guide & Training Program – StrengthLog\nhttps://www.strengthlog.com/strength-training-for-judo/\nPhysical and Physiological Profiles of Brazilian Jiu-Jitsu Athletes: a Systematic Review | Sports\nMedicine - Open | Full Text\nhttps://sportsmedicine-open.springeropen.com/articles/10.1186/s40798-016-0069-5\nWrestling\nhttps://www.nsca.com/education/articles/kinetic-select/wrestling/?\nsrsltid=AfmBOooVxFUzHOscQAOJKAHRzJ0t_6YbHXOXwXHj85MfzXYyM_msm_Mc\nDan Gable Quotes - BrainyQuote\nhttps://www.brainyquote.com/authors/dan-gable-quotes\nCheck Some Advanced Tips for Jiu Jitsu for Beginners\nhttps://gbriverton.com/jiu-jitsu-for-beginners-advanced-training-tips-bjj-ultimate-guide/\nNutrition Basics For The Jiu-jitsu Athlete | Women Who Fight\nhttps://womenwhofight.co.uk/articles/what-the-research-says/nutrition-basics-for-the-jiu-jitsu-athlete/\nOptimizing Nutrition for BJJ Athletes: Top Tips to Fuel Performance ...\nhttps://www.bjjee.com/articles/optimizing-nutrition-for-bjj-athletes-top-tips-to-fuel-performance-and-accelerate-recovery/\nNo food, no water: How wrestlers 'cut weight' before the big events - ESPN\nhttps://www.espn.com/wrestling/story/_/id/31636607/no-food-no-water-how-wrestlers-cut-weight-big-events\nPhysiological, Nutritional and Performance Profiles of Brazilian Jiu ...\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC5260595/\nRest And Recovery For BJJ | Evolve Daily\nhttps://evolve-mma.com/blog/rest-and-recovery-for-bjj/\nInjury prevention warm-up in grappling sports\nhttps://www.scienceforsport.com/injury-prevention-grappling-sports/?\nsrsltid=AfmBOorvIraKENhKrBuXhyIKwkbcBanM45zGidHEwod2dogAYtmO-86g\nBJJ From Beginners and Intermediate to Advanced\nhttps://thegrapplinglab.com.au/bjj-beginners-intermediate-advanced/\n10 Tips For Beginners in Brazilian Jiu Jitsu (BJJ) - Roger Gracie Academy North Bristol\nhttps://www.rogergracienorthbristol.com/blog/10-tips-for-beginners-in-brazilian-jiu-jitsu-bjj/\nSpecial Strength Training for Wrestlers - The KEY to Building Dominant Wrestlers • Zach Even-Esh\nhttps://zacheven-esh.com/special-strength-training-for-wrestlers/\nJiu Jitsu Quotes: Wisdom and Inspiration from the Mats - JiuJitsu News\nhttps://jiujitsu-news.com/jiu-jitsu-quotes/\n12314181921616266\n4567891011123738\n13152271\n161772\n205268\n23244748575859636470\n2531\n26\n272829\n30\n323334\n3536\n39\n4041515675\n424373\n44454655\n22\n\nPlease, what would you advice a new judoka to do? (Generally athletic, grappling\nexperienced). It just feels so weird and nothing works against good guys : r/judo\nhttps://www.reddit.com/r/judo/comments/1ipcfjh/please_what_would_you_advice_a_new_judoka_to_do/\nCompetition Anxiety in Combat Sports and the Importance of Mental Toughness - PMC\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC10525228/\nUFC Fighter Ryan Loder Shares Advice for Wrestlers, Stresses Mental Health » SportStars\nMagazine\nhttps://sportstarsmag.com/2025/02/ufc-fighter-ryan-loder-shares-advice-for-wrestlers-mental-health/\n49505354\n6067\n656974\n23",
  "sourcePdf": "Coaching Advice for Grappling Athletes_ Wrestling, Judo, and BJJ.pdf",
  "createdAt": "2025-07-21T03:30:59.933Z",
  "metadata": {
    "pages": 0,
    "fileSize": "158KB",
    "extractedAt": "2025-07-21T03:30:59.933Z"
  }
}